app/Controllers/CashierScreenController.php

public function checkout()
{

    $CartItems = model('CartItems');
    $OrderModel = model('OrderModel');
    $CartModel = model('CartModel');



    // $order = $CartItems->getOrders();
    $grandtotal = $this->request->getPost('grandtotal');
    $items = json_decode($this->request->getPost('items'), true);
    $orderid = $OrderModel->getInsertID();

    $date = date('Ymd');
    $invoiceNo = 'INV-' . $date . '-' . str_pad($orderid, 4, '0', STR_PAD_LEFT);
     $orderData = [
        '   invoice_no' => $invoiceNo,
            'subtotal' =>   $grandtotal,
            'total_amount' =>  $grandtotal,
            'payment_method' => 'cash',
        ];

        $OrderModel->insert([
            'subtotal' => $grandtotal,
            'total_amount' => $grandtotal,
            'payment_method' => 'cash',
        ]);
---
INSERT INTO `tbl_order` (`subtotal`, `total_amount`, `payment_method`) VALUES ('16', '16', 'cash')


$CartItems->insertBatch($batchData);

$CartModel->where('user_id', session()->get('user_id'))
          ->delete();
---
DELETE FROM `tbl_cart`
WHERE `user_id` = '12'

public function addtocartClick()
{
   $model = model('CartModel');

   $product_id = $this->request->getPost('product_id');
   $user = session()->get('user_id');


   $existingItem = $model
   ->where('product_id', $product_id)->first();

   if ($existingItem) {
       // Increase quantity
        $model->update(
            $existingItem['cart_id'],
            [
                'quantity' => $existingItem['quantity'] + 1
            ]
        );

        return $this->response->setJSON([
            'status' => 'success',
            'message' => 'Item quantity updated',
        ]);
   }

   $model->insert([
    'product_id' => $product_id,
    'quantity' => 1,
    'user_id' => $user,
   ]);
---
INSERT INTO `tbl_cart` (`product_id`, `quantity`, `user_id`) VALUES ('18', 1, '12')