app/Models/PosTerminal.php

    public function getCartItem()
    {
        $builder =  $this->db->table($this->table);
        $builder->join('tbl_products', 'tbl_cart.product_id = tbl_products.product_id', 'left');

        return $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_cart`
LEFT JOIN `tbl_products` ON `tbl_cart`.`product_id` = `tbl_products`.`product_id`