app/Models/ProductModel.php

public function getProducts($category_id = null, $search = null)
{
    $builder = $this->db->table($this->table);

    $builder->select('tbl_products.*, tbl_category.category_name');
    $builder->join('tbl_category', 'tbl_products.category_id = tbl_category.category_id', 'left');

    if (!empty($category_id)) {
        $builder->where('tbl_products.category_id', $category_id);
    }

    if (!empty($search)) {
        $builder->like('tbl_products.product_name', $search);
    }

    return $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_category`
SELECT `tbl_products`.*, `tbl_category`.`category_name`
FROM `tbl_products`
LEFT JOIN `tbl_category` ON `tbl_products`.`category_id` = `tbl_category`.`category_id`
WHERE `tbl_products`.`product_name` LIKE '%cor%' ESCAPE '!'

    public function getCategory()
    {
        return $this->db->table('tbl_category')->get()->getResultArray();
---
SELECT *
FROM `tbl_category`