app/Models/UserModel.php

    public function getUsers()
    {
        return $this->db->table($this->table)->get()->getResultArray();
---
SELECT *
FROM `tbl_users`